# დაასრულეთ ამოხსნა ისე, რომ მასში გადატანილი სტრიქონი შებრუნებულად წარიმართოს.

# def solution(string):
#     return string[::-1]
# print(solution("world"))

# თქვენ იღებთ რიცხვების მასივს, აბრუნებთ ყველა დადებითი რიცხვის ჯამს. მაგალითი [1, 4, 7, 12] => 1 + 7 + 12 = 20 1+7+12=20 შენიშვნა თუ შესაჯამებელი არაფერია, ჯამი ნაგულისხმევად 0-ის ტოლია.

# def positive_sum(arr):
#     sum = 0
#     for num in arr:
#         if num >0:
#             sum += num
#     return sum


# დაწერეთ ფუნქცია, რომელიც პარამეტრებად იღებს არაუარყოფით მთელ რიცხვს nდა სტრიქონს და აბრუნებს ზუსტად რამდენჯერმე გამეორებულ სტრიქონს.ssn

# def repeat_str(repeat, string):
#     return repeat * string


# შეავსეთ კვადრატული შეჯამების ფუნქცია ისე, რომ მასში შეყვანილი თითოეული რიცხვი კვადრატში აიყვანოს და შემდეგ შედეგები ერთად შეაჯამოს. მაგალითად, [1, 2, 2]-ისთვის ის უნდა დააბრუნოს 9, რადგან 1 2 + 2 2 + 2 2 = 9 1 2 +2 2 +2 2 =9

# def square_sum(numbers):
#     total=0
#     for num in numbers:
#         total += num ** 2
#     return total

# შენიშვნა: ეს კატა შთაგონებულია „რიცხვის სტრიქონად გარდაქმნით!“-ით. სცადეთ ესეც. აღწერა ჩვენ გვჭირდება ფუნქცია, რომელსაც შეუძლია სტრიქონის რიცხვად გარდაქმნა. ამის მიღწევის რა გზები იცით? შენიშვნა: არ ინერვიულოთ, ყველა შეყვანა იქნება სტრიქონი და ყველა სტრიქონი არის სრული რიცხვის სრულიად ვალიდური წარმოდგენა.

# def string_to_number(s):
#     return int(s)