# 1) მომხმარებელს შემოატანინეთ სიტყვა და დაპრინტეთ თუ ამ სიტყვაში რამდენი ასო მეორდება ზუსტად 2-ჯერ, მაგალითად: თუ მომხმარებელმა შემოიტანა სიტყვა "Niiooookkaa", ამ სიტყვაში ჩვენ გვაქვს სამი ასო რომელიც სიტყვაში ზედიზედ ზუსტად 2-ჯერ მეორდება: ii, kk, aa, ამიტომ უნდა დავპრინტოთ 3. არ გამოიყენოთ count ფუნქცია, არ დაგეზაროთ!

# 2) მომხმარებელს შემოატანინეთ სტრინგი რომელშიც იქნება ასოებიც და რიცხვებიც, მაგალითად - "G3lkij6m7m844", ჩვენი დავალებაა რომ დავპრინტოთ ამ სტრინგში მყოფი რიცხვების ჯამი. დღეს ვისწავლეთ მაგრამ ამ დავალებაში არ გამოიყენოთ split() ფუნქცია.

# 3) მომხმარებელს შემოატანინეთ წინადადება რომელიც იწყება რამდენიმე სფეისით, ცარიელი ადგილებით, და ყოველ სიტყვებს შორის იყოს ერთის მაგივრად რამდენიმე ცარიელი ადგილი, და წინადადება ასევე დამთავრდეს რამდენი სფეისით, მაგალითად: "    I    love    Python    ". თქვენი დავალებაა რომ დაპრინტოთ მომხმარებლის მოცემული წინადადება ჩვეულებრივი, ერთ-ერთი სფეისების გამოტოვებით, ამ შემთხვევაში ასე - "I love Python".

# 4) შექმენით რიცხვებით სავსე სტრინგი, თქვენი დავალებაა დაითვალოთ და დაპრინტოთ თუ რამდენი რიცხვი არის მის უკან მდგომ რიცხვზე დიდი. მაგალითად თუ გვაქვს მოცემული სია - [1, 3,  2, 4, 6, 5], 3 > 1, 4 > 2, 6 > 4, გამოდის რომ გვაქვს ასეთი 3 რიცხვი, დავპრინტავთ მათ რაოდენობას, 3-ს.

# 5) მომხმარებელს შემოატანინეთ სტრინგ ტიპის მონაცემი და დაპრინტეთ ყველაზე მეტჯერ ზედიზედ რამდენი ასო მეორდება. მაგალითად: მომხმარებელმა შემოიტანა სტრინგი "aaabbccccdaa", a ასო კი მეორდება 5-ჯერ, მაგრამ არ მეორდება ზედიზედ, ამიტომ მას არ ვთვლით. ზედიზედ ყველაზე მეტჯერ მეორდება ასო c, მეორდება 4-ჯერ, ამიტომ ვპრინტავთ რიცხვ 4-ს.

# 6) მომხმარებელს შემოატანინეთ სიტყვა, დაპრინტეთ ამ სიტყვის პირველი ასო რომელიც არ მეორდება. მაგალითად: თუ მოცემული გვაქვს სიტყვა "swiss", სიტყვის დასაწყისიდან პირველი ასო რაც გვხვდება რომელიც არ მეორდება არის "w", ამიტომ ვპრინტავთ "w"-ს.

# 7) შექმენით დუპლიკატებით სავსე რიცხვების სია, და ამ სიიდან ამოშალეთ მხოლოდ ისეთი დუპლიკატები რომლებიც ერთად დგანან. მაგალითად: თუ მოცემული გვაქვს სია [1, 1, 2, 2, 2, 3, 1, 1, 3] უნდა მივიღოთ [1, 2, 3, 1, 3]. 3 და 3 ერთმანეთის გასწვრივ არ იდგნენ, ამიტომ ამ დუპლიკატებს არ ვშლით.

# 8) მომხმარებელს შემოატანინეთ წინადადება და დაპრინტეთ მხოლოდ ის სიტყვები რომლებსაც შიგნით არ აქვთ არც რიცხვები და არც სიმბოლოები, მაგალითად: თუ მომხმარებელმა შემოიტანა წინადადება "Hi there2 friend!", ჩვენ უნდა დავპრინტოთ Hi.

# 9) შექმენით რიცხვებით სავსე სია, და დაპრინტეთ ახალი სია რომელშიც იქნება ყველა ინდექსამდე მდგომი რიცხვების ჯამი, მაგალითად: თუ მოცემული გვაქვს სია nums = [1, 2, 3, 4], ახალ სიაში უნდა ჩავამტოთ 1 რადგან ჩვენი სია იწყება 1-ით, შემდეგ, ახალ სიაში უნდა ჩავამატოთ 2 + 1 ანუ 3, შემდეგ სიაში უნდა ჩავამატოთ 3 + 2 + 1 ანუ 6, და ბოლოს უნდა ჩავამატოთ 4 + 3 + 2 + 1 ანუ 10, მივიღებთ სიას [1, 3, 6, 10].

# 10) მომხმარებელს შემოატანინეთ წინადადება და დაპრინტეთ ისეთი სიტყვების რაოდენობა რომლებიც მთავრდებიან ხმოვან ასოზე. მაგალითად: თუ მომხმარებელმა შემოიტანა წინადადება "I like to code in Python", ამ წინადადებაში 4 სიტყვა მთავდება ხმოვანი ასოთი, "I", "like", "to" და "code", ამიტომ დავპრინტავთ 4-ს.